{
  "CRS": [
    {
      "name": "CR",
      "description": "control register",
      "offset": "0x00",
      "fields": [
        {
          "name": "TRIM",
          "description": "HSI48 oscillator smooth trimming These bits provide a user-programmable trimming value to the HSI48 oscillator. They can be programmed to adjust to variations in voltage and temperature that influence the oscillator frequency. The default value is 32, corresponding to t he middle of the trimming interval. The trimming step is specified in the produ ct datasheet. A higher TRIM va lue corresponds to a higher output frequency. When the AUTOTRIMEN bit is set, this field is controlled by hardware and is read-only.",
          "values": [],
          "mask": "0b11111100000000"
        },
        {
          "name": "SWSYNC",
          "description": "Generate software SYNC event This bit is set by software in order to gene rate a software SYNC event. It is automatically cleared by hardware.",
          "values": [
            ["0", "No action"],
            ["1", "A software SYNC event is generated."]
          ],
          "mask": "0b10000000"
        },
        {
          "name": "AUTOTRIMEN",
          "description": "Automatic trimming enable This bit enables the automatic ha rdware adjustment of TRIM bits according to the measured frequency error between two SYNC events. If this bit is set, the TRIM bits are read-only. The TRIM value can be adjusted by hardware by o ne or two steps at a time, depending on the measured frequency error value. Refer to Section 9.5.3 for more details.",
          "values": [
            ["0", "Automatic trimming disabled, TRIM bits can be adjusted by the user."],
            ["1", "Automatic trimming enabled, TRIM bits are read-only and under hardware control."]
          ],
          "mask": "0b1000000"
        },
        {
          "name": "CEN",
          "description": "Frequency error counter enable This bit enables the oscillator clock for the frequency error counter.",
          "values": [
            ["0", "Frequency error counter disabled"],
            ["1", "Frequency error counter enabledWhen this bit is set, the CRS_CFGR regist er is write-protect ed and cannot be modified."]
          ],
          "mask": "0b100000"
        },
        {
          "name": "ERRIE",
          "description": "Synchronization or trimming error interrupt enable",
          "values": [
            ["0", "Synchronization or trimming error (ERRF) interrupt disabled"],
            ["1", "Synchronization or trimming error (ERRF) interrupt enabled"]
          ],
          "mask": "0b100"
        },
        {
          "name": "SYNCWARNIE",
          "description": "SYNC warning interrupt enable",
          "values": [
            ["0", "SYNC warning (SYNCWARNF) interrupt disabled"],
            ["1", "SYNC warning (SYNCWARNF) interrupt enabled"]
          ],
          "mask": "0b10"
        },
        {
          "name": "SYNCOKIE",
          "description": "SYNC event OK interrupt enable",
          "values": [
            ["0", "SYNC event OK (SYNCOKF) interrupt disabled"],
            ["1", "SYNC event OK (SYNCOKF) interrupt enabled"]
          ],
          "mask": "0b1"
        },
        {
          "name": "Reserved",
          "description": "must be kept at reset value.",
          "values": [],
          "mask": "0b11111111111111111100000000010000"
        }
      ]
    },
    {
      "name": "CFGR",
      "description": "configuration register",
      "offset": "0x04",
      "fields": [
        {
          "name": "SYNCPOL",
          "description": "SYNC polarity selection This bit is set and cleared by software to select the input polarity for the SYNC signal source.",
          "values": [
            ["0", "SYNC active on rising edge (default)"],
            ["1", "SYNC active on falling edge"]
          ],
          "mask": "0b10000000000000000000000000000000"
        },
        {
          "name": "SYNCSRC",
          "description": "SYNC signal source selection These bits are set and cleared by software to select the SYNC signal source.",
          "values": [
            ["00", "USB2 SOF selected as SYNC signal source"],
            ["01", "LSE selected as SYNC signal source"],
            ["10", "OTG HS1 SOF selected as SYNC signal source (default)"],
            ["11", "ReservedWhen using USB LPM (Link Power Management) and the device is in Sleep mode, the periodic USB SOF will not be generated by the host. No SYNC signal will therefore be provided to the CRS to calibrate the HSI48 o scillator on the run. To guarantee the required clock precision after waking up from Sleep mode, the LSE clock or the SYNC pin should be used as SYNC signal."]
          ],
          "mask": "0b110000000000000000000000000000"
        },
        {
          "name": "FELIM",
          "description": "Frequency error limit FELIM contains the value to be used to eval uate the captured frequency error value latched in the FECAP[15:0] bits of th e CRS_ISR register. Refer to Section 9.5.3 for more details about FECAP evaluation.",
          "values": [],
          "mask": "0b111111110000000000000000"
        },
        {
          "name": "RELOAD",
          "description": "Counter reload value RELOAD is the value to be loaded in the frequency error counter with each SYNC event. Refer to Section 9.5.2 for more details about counter behavior.",
          "values": [],
          "mask": "0b1111111111111111"
        },
        {
          "name": "Reserved",
          "description": "must be kept at reset value.",
          "values": [],
          "mask": "0b1001000000000000000000000000000"
        }
      ]
    },
    {
      "name": "ISR",
      "description": "interrupt and status register",
      "offset": "0x08",
      "fields": [
        {
          "name": "6",
          "description": "2431 30 29 28 27 26 25 24 23 22 21 20 19 18 17 16 FECAP[15:0] rrrrrrrrrrrr r r r r 15 14 13 12 11 10 9 8 7 6 5 4 3 2 1 0 FEDIR Res. Res. Res. Res.TRIM OVFSYNC MISSSYNC ERRRes. Res. Res. Res. ESYNCF ERRFSYNC WARNFSYNC OKF r rrr r r r r",
          "values": [],
          "mask": "0b100"
        },
        {
          "name": "FECAP",
          "description": "Frequency error capture FECAP is the frequency error counter value la tched in the time of the last SYNC event. Refer to Section 9.5.3 for more details about FECAP usage.",
          "values": [],
          "mask": "0b11111111111111110000000000000000"
        },
        {
          "name": "FEDIR",
          "description": "Frequency error direction FEDIR is the counting direction of the frequency error counter latched in the time of the last SYNC event. It shows whether the actual frequency is below or above the target.",
          "values": [
            ["0", "Up-counting direction, the actual frequency is above the target"],
            ["1", "Down-counting direction, the actual frequency is below the target"]
          ],
          "mask": "0b1000000000000000"
        },
        {
          "name": "TRIMOVF",
          "description": "Trimming overflow or underflow This flag is set by hardware when the automat ic trimming tries to over- or under-flow the TRIM value. An interrupt is generated if the ER RIE bit is set in the CRS_CR register. It is cleared by software by setting the ERRC bit in the CRS_ICR register.",
          "values": [
            ["0", "No trimming error signaled"],
            ["1", "Trimming error signaled"]
          ],
          "mask": "0b10000000000"
        },
        {
          "name": "SYNCMISS",
          "description": "SYNC missed This flag is set by hardware when the freq uency error counter reaches value FELIM * 128 and no SYNC is detected, meanin g either that a SYNC pulse was missed, or the frequency error is too big (internal frequency too high) to be compensated by adjusting the TRIM value, hence some other action must be taken. At this point, the frequency error counter is stopped (waiting for a next SYNC), and an interrupt is generated if the ERRIE bit is set in the CRS_CR register. It is cleared by software by setting the ERRC bit in the CRS_ICR register.",
          "values": [
            ["0", "No SYNC missed error signaled"],
            ["1", "SYNC missed error signaled"]
          ],
          "mask": "0b1000000000"
        },
        {
          "name": "SYNCERR",
          "description": "SYNC error This flag is set by hardware when the SYNC pulse arrives before the ESYNC event and the measured frequency error is greater than or equal to FELIM * 128. This means that the frequency error is too big (internal frequency to o low) to be compensated by adjusting the TRIM value, and that some other action has to be taken. An interrupt is generated if the ERRIE bit is set in the CRS_CR register. It is cleared by software by setting the ERRC bit in the CRS_ICR register.",
          "values": [
            ["0", "No SYNC error signaled"],
            ["1", "SYNC error signaled"]
          ],
          "mask": "0b100000000"
        },
        {
          "name": "ESYNCF",
          "description": "Expected SYNC flag This flag is set by hardware when the frequency error counter reached a zero value. An interrupt is generated if the ESYNCIE bit is set in the CRS_CR register. It is cleared by software by setting the ESYNCC bit in the CRS_ICR register.",
          "values": [
            ["0", "No expected SYNC signaled"],
            ["1", "Expected SYNC signaled"]
          ],
          "mask": "0b1000"
        },
        {
          "name": "ERRF",
          "description": "Error flag This flag is set by hardware in case of any synch ronization or trimming error. It is the logical OR of the TRIMOVF, SYNCMISS and SYNCERR bits . An interrupt is generated if the ERRIE bit is set in the CRS_CR register. It is cleared by software in reaction to setting the ERRC bit in the CRS_ICR register, which clears the TRIMOVF, SYNCMISS and SYNCERR bits.",
          "values": [
            ["0", "No synchronization or trimming error signaled"],
            ["1", "Synchronization or trimming error signaled"]
          ],
          "mask": "0b100"
        },
        {
          "name": "SYNCWARNF",
          "description": "SYNC warning flag This flag is set by hardware when the measured frequency error is greater than or equal to FELIM * 3, but smaller than FE LIM * 128. This means that to compensate the frequency error, the TRIM value must be adjusted by two steps or more. An interrupt is generated if the SYNCWARNIE bit is set in the CRS_CR register. It is cleared by software by setting the SYNCWARNC bit in the CRS_ICR register.",
          "values": [
            ["0", "No SYNC warning signaled"],
            ["1", "SYNC warning signaled"]
          ],
          "mask": "0b10"
        },
        {
          "name": "SYNCOKF",
          "description": "SYNC event OK flag This flag is set by hardware when the measured frequency error is smaller than FELIM * 3. This means that either no adjust ment of the TRIM value is neede d or that an adjustment by one trimming step is enough to compensate the frequency error. An interrupt is generated if the SYNCOKIE bit is set in the CRS_CR register. It is cleared by software by setting the SYNCOKC bit in the CRS_ICR register.",
          "values": [
            ["0", "No SYNC event OK signaled"],
            ["1", "SYNC event OK signaled"]
          ],
          "mask": "0b1"
        },
        {
          "name": "Reserved",
          "description": "must be kept at reset value.",
          "values": [],
          "mask": "0b111100011110000"
        }
      ]
    },
    {
      "name": "ICR",
      "description": "interrupt flag clear register",
      "offset": "0x0C",
      "fields": [
        {
          "name": "ESYNCC",
          "description": "Expected SYNC clear flag Writing 1 to this bit clears the ESYNCF flag in the CRS_ISR register.",
          "values": [],
          "mask": "0b1000"
        },
        {
          "name": "ERRC",
          "description": "Error clear flag Writing 1 to this bit clears TRIMOVF, SYNCMISS and SYNCERR bits and consequently also the ERRF flag in the CRS_ISR register.",
          "values": [],
          "mask": "0b100"
        },
        {
          "name": "SYNCWARNC",
          "description": "SYNC warning clear flag Writing 1 to this bit clears the SY NCWARNF flag in the CRS_ISR register.",
          "values": [],
          "mask": "0b10"
        },
        {
          "name": "SYNCOKC",
          "description": "SYNC event OK clear flag Writing 1 to this bit clears the SYNCOKF flag in the CRS_ISR register.",
          "values": [],
          "mask": "0b1"
        },
        {
          "name": "Reserved",
          "description": "must be kept at reset value.",
          "values": [],
          "mask": "0b11111111111111111111111111110000"
        }
      ]
    }
  ]
}
